# Origin Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevolvedFace..::..Origin Property
RevolvedFace Class See Also
---
Origin of the surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Origin { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Origin As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Origin {
	XYZ^ get ();
}
```

# See Also
RevolvedFace Class
Autodesk.Revit.DB Namespace